using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

namespace WoodenBench_Desktop.staClass
{
    class ErrorProcess
    {
        public static string GetErrMessage(string ErrCode)
        {
            string StrRtn = "";
            ErrDict.TryGetValue(ErrCode, out StrRtn);
            return StrRtn;
        }
        public static Dictionary<string, string> ErrDict = new Dictionary<string, string>
        {
            {"101","查询的对象或Class不存在或者登录接口的用户名或密码不正确"},
            {"102","查询中的字段名是大小写敏感的，且必须以英文字母开头，有效的字符仅限在英文字母、数字以及下划线,或查询对应的字段值不匹配，或提供的地理位置格式不正确"},
            {"103","查询单个对象或更新对象时必须提供objectId或非法的class名称，class名称是大小写敏感的，并且必须以英文字母开头，有效的字符仅限在英文字母、数字以及下划线."},
            {"104","关联的class名称不存在"},
            {"105","字段名是大小写敏感的，且必须以英文字母开头，有效的字符仅限在英文字母、数字以及下划线或字段名是Bmob默认保留的，如objectId,createdAt,updateAt,ACL"},
            {"106","不是一个正确的指针类型"},
            {"107","输入的json不是正确的json格式"},
            {"107","请求只支持Header头部Content-Type值为application/json或application/json;charset=utf-8"},
            {"107","时间格式不正确"},
            {"107","ACL应该像这样的{'*':{'read':true},'eAfHB29gP9':{'write':true}}"},
            {"107","不是正确的__op的值"},
            {"108","用户名和密码是必需的"},
            {"109","登录信息是必需的，如邮箱和密码时缺少其中一个提示此信息"},
            {"111","传入的字段值与字段类型不匹配，期望是这样(%s)的，但传过来却是这样(%s)的"},
            {"112","requests的值必须是数组"},
            {"113","requests数组中每个元素应该是一个像这样子的json对象"},
            {"114","requests数组大于50"},
            {"117","纬度范围在[-90,90]或经度范围在[-180,180]"},
            {"120","要使用此功能，请在Bmob后台应用设置中打开邮箱认证功能开关"},
            {"131","不正确的deviceToken"},
            {"132","不正确的installationId"},
            {"133","不正确的deviceType"},
            {"134","已经存在"},
            {"135","installationId已经存在"},
            {"136","只读属性不能修改或android设备不需要设置deviceToken"},
            {"138","表是只读的"},
            {"139","角色名称是大小写敏感的，并且必须以英文字母开头，有效的字符仅限在英文字母、数字、空格、横线以及下划线。"},
            {"140","角色名称已经存在。"},
            {"141","缺失推送需要的data参数"},
            {"142","时间格式应该如下：2013-12-0400:51:13"},
            {"143","必须是一个数字"},
            {"144","不能是之前的时间"},
            {"145","文件大小错误"},
            {"146","文件名错误"},
            {"147","文件分页上传偏移量错误"},
            {"148","文件上下文错误"},
            {"149","空文件"},
            {"150","文件上传错误"},
            {"151","文件删除错误"},
            {"160","图片错误"},
            {"161","图片模式错误"},
            {"162","图片宽度错误"},
            {"163","图片高度错误"},
            {"164","图片长边错误"},
            {"165","图片短边错误"},
            {"201","缺失数据"},
            {"202","用户名已经存在"},
            {"203","邮箱已经存在"},
            {"204","必须提供一个邮箱地址"},
            {"205","没有找到此邮件的用户"},
            {"206","登录用户才能修改自己的信息。RestAPI的HttpHeader中没有提供sessionToken的正确值，不能修改或删除用户"},
            {"207","验证码错误"},
            {"208","authData不正确"},
            {"209","该手机号码已经存在"},
            {"210","旧密码不正确"},
            {"301","验证错误详细提示，如邮箱格式不正确"},
            {"302","Bmob后台设置了应用设置值，如'不允许SDK创建表'"},
            {"310","云端逻辑运行错误的详细信息"},
            {"311","云端逻辑名称是大小写敏感的，且必须以英文字母开头，有效的字符仅限在英文字母、数字以及下划线。"},
            {"401","唯一键不能存在重复的值"},
            {"402","查询的wher语句长度大于具体多少个字节"},
            {"601","不正确的BQL查询语句" }
        };
    }
}